-- WhitelistEvents.lua

WhitelistEvents = {
    {
        title = "День Ахоева рождения!",
        cellBackground = "Interface\\AddOns\\Ahoydar\\Textures\\inv_misc_celebrationcake_01.jpg",
        description = "День рождения основателя голдфармерского движения \"Жетон каждому малютке\"",
        links = {
            { name = "", url = "https://example.com/birthday_video" },
        },
    },
    {
        title = "Ярмарка Новолуния",
        cellBackground = "Interface\\AddOns\\Ahoydar\\Textures\\calendar_darkmoonfaireelwynnstart.tga",
        description = [[
Это владение для твоей профы, а также талантики.
Список предметов для квестов:
Алхимия: "Коктейль с пузырьками" (требуется: 5 Сок луноягоды)
Кузнечное дело: "Малышке нужны новые подковы"
Наложение чар: "Утилизация хлама"
Инженерное дело: "Кстати, о хламе"
Травничество: "Целебные травы"
Начертание: "Предсказание будущего" (требуется: 5 Тонкий пергамент)
Ювелирное дело: "Пусть ярмарка сверкает"
Кожевничество: "Изготовление призов" (требуется: 10 Блесна, 5 Грубая нить, 5 Синяя краска)
Горное дело: "Повторное использование и переработка"
Снятие шкур: "Отскоблить шкуры"
Портняжное дело: "Флаги, флаги всюду!" (требуется: 1 Грубая нить, 1 Красная краска, 1 Синяя краска)
Археология: "Развлечение для самых маленьких"
Кулинария: "Лягушки с хрустящей корочкой" (требуется: 5 Простая мука)
Рыбная ловля: "Морской хот-дог"
        ]],
links = {
    { name = "Передача валюты и сокровища", url = "https://youtu.be/G65TPAPlta8" },
    { name = "Зелья новолуния", url = "https://youtu.be/e_K4Sek2_pM" },
}
    },
}
